package Level_04.Task_1421;

/**
 * Title - Singleton # 1421.
 * @task Наибольший общий делитель (НОД).
 * Ввести с клавиатуры 2 целых положительных числа.
 * Вывести в консоль наибольший общий делитель.
 *
 * Требования:
 * •	Программа должна считывать с клавиатуры 2 строки.
 * •	В случае если введенные строки невозможно преобразовать в положительные целые числа, должно возникать исключение.
 * •	Программа должна выводить данные на экран.
 * •	Программа должна выводить на экран наибольший общий делитель(НОД) чисел считанных с клавиатуры и успешно завершаться.
 */

public class Solution {
    public static void main(String[] args) {}
}
